rules = {
    "tables": {
        "table": {
            "min": 80, "max": 220, "step": 20, "name": "стола",  # min max размеры для проверки, шаг, назв если ошибка
            "montage_offset": 20, "montage_count": 1, "modul_name": "Стол диспетчера"},
        # параметры для шины монтажной: длина модуля -, и кол-во
        "table_left": {
            "min": 60, "max": 220, "step": 10, "name": "модуля левого",
            "montage_offset": 10, "montage_count": 1, "modul_name": "модуль стола для диспетчера левый"},
        "table_right": {
            "min": 60, "max": 220, "step": 10, "name": "модуля правого",
            "montage_offset": 10, "montage_count": 1, "modul_name": "модуль стола для диспетчера правый"},
        "table_mid": {
            "min": 100, "max": 220, "step": 10, "name": "модуля промежуточного",
            "montage_offset": 0, "montage_count": 1, "modul_name": "модуль стола для диспетчера промежуточный"},
        # эти типы имеют 1 размер, поэтому отличаются, они не требуют проверки и тут просто константы:
        "table_angle_22": {"len": 100, "montage_len": 97, "montage_count": 1, "name": "модуля углового 22°",
                           "modul_name": "модуль стола для диспетчера угловой 22°"},
        "table_angle_22_l": {"len": 120, "montage_len": 97, "montage_count": 1, "name": "модуля углового левого 22°",
                             "modul_name": "модуль стола для диспетчера угловой 22 левый°"},
        "table_angle_22_r": {"len": 120, "montage_len": 97, "montage_count": 1, "name": "модуля углового правого 22°",
                             "modul_name": "модуль стола для диспетчера угловой 22 правый°"},
        "table_angle_90": {"len": 100, "montage_len": 70, "montage_count": 2, "name": "модуля углового 90°",
                           "modul_name": "модуль стола для диспетчера угловой 90°"},

    },
    "screens": [0, 45, 85],  # допустимые параметры размеров по высоте для экранов, 0 обозначает отсутствие экрана
    "side_panel_art": "ФЛ-091",  # артикул для боковых панелей ЛДСП
    "table_depth": 100,  # стандартная глубина стола
    "table_height": 76,  # стандартная высота стола
    "table_desk_thikness": 3.2,  # стандартная толщина столешницы
    "table_metall_color": "RAL7047",  # стандартный цвет металлокаркаса
    "table_desk_color": "Арктика серый",  # стандартный цвет столешницы и боковин
    "ldsp_price_area": 8000,  # цена за 1 м кв для оценки стоимости ЛДСП # цена просто для примера (актуализирована на Стр 11011 16.05.2025)
    "indent_text_render": "  ",  # отступ при рендере строк для консоли
    "price_console": True,  # показывать цены в консоли (false чтобы не показывать)
}
